---
type: RebarShapeConstraintChordLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# RebarShapeConstraintChordLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintChordLength | 2012 | `public RebarShapeConstraintChordLength ( ElementId paramId )` |